app/controllers/books_controller.rb

  def index
    @page = params[:page].to_i
    @books = Book.all
---
SELECT "books".* FROM "books" ORDER BY "books"."id" ASC

  def create
    @book = Book.new(book_params)
   if @book.save
      flash[:notice] = "Book was successfully added."
      redirect_to books_path
    else
      flash[:notice] = "Failed to add the book, check your inputs."
      @books = Book.all
---
INSERT INTO "books" ("title", "author", "price", "published_date", "publisher", "pages", "release_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT "books".* FROM "books"

  def update
    @book = Book.find(params[:id])
    if  @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "author" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["author", "lily"], ["updated_at", "2024-01-28 18:43:42.120747"], ["id", 7]]